test/fixtures/create_subscription.yml

---
http_interactions:
- request:
    method: post
    uri: http://api.boffin-dev.io:3000/v1/customers/1398/subscriptions
    body:
      encoding: US-ASCII
      string: plan=foo&metadata[provider]=heroku&start=2014-01-01%2000%3A00%3A00%20%2B0000
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Boffin/v1 RubyBindings/0.0.1
      Authorization:
      - Token token=141d246d5e0774eaab3482259516dae9
      Content-Type:
      - application/x-www-form-urlencoded
      Stripe-Version:
      - v1
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"0.0.1","lang":"ruby","lang_version":"2.0.0 p481 (2014-05-08)","platform":"x86_64-linux","publisher":"boffinio","uname":"Linux
        tim-laptop 3.13.0-37-generic #64-Ubuntu SMP Mon Sep 22 21:28:38 UTC 2014 x86_64
        x86_64 x86_64 GNU/Linux"}'
      Content-Length:
      - '76'
  response:
    status:
      code: 201
      message: 'Created '
    headers:
      X-Frame-Options:
      - SAMEORIGIN
      X-Xss-Protection:
      - 1; mode=block
      X-Content-Type-Options:
      - nosniff
      Location:
      - http://api.boffin-dev.io:3000/v1/customers/1398/subscriptions/7066
      Content-Type:
      - application/json; charset=utf-8
      Etag:
      - '"4272e7f380bbdbaff2ebc14a016f06f0"'
      Cache-Control:
      - max-age=0, private, must-revalidate
      X-Request-Id:
      - 19030148-df93-442b-b672-13e215ce8bd3
      X-Runtime:
      - '0.363081'
      Server:
      - WEBrick/1.3.1 (Ruby/2.0.0/2014-05-08)
      Date:
      - Fri, 24 Oct 2014 18:08:55 GMT
      Content-Length:
      - '207'
      Connection:
      - Keep-Alive
      Set-Cookie:
      - request_method=POST; path=/
    body:
      encoding: UTF-8
      string: '{"object":"subscription","start":"2014-01-01T00:00:00.000Z","canceled_at":null,"metadata":{"provider":"heroku"},"plan":{"object":"plan","slug":"foo","amount":0,"currency":"usd"},"customer":{"ref_id":"1398"}}'
    http_version: 
  recorded_at: Fri, 24 Oct 2014 18:08:55 GMT
recorded_with: VCR 2.9.3
