test/fixtures/customer_subscriptions.yml

---
http_interactions:
- request:
    method: get
    uri: http://api.boffin-dev.io:3000/v1/customers/1398/subscriptions
    body:
      encoding: US-ASCII
      string: ''
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Boffin/v1 RubyBindings/0.0.1
      Authorization:
      - Token token=141d246d5e0774eaab3482259516dae9
      Content-Type:
      - application/x-www-form-urlencoded
      Stripe-Version:
      - v1
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"0.0.1","lang":"ruby","lang_version":"2.0.0 p481 (2014-05-08)","platform":"x86_64-linux","publisher":"boffinio","uname":"Linux
        tim-laptop 3.13.0-37-generic #64-Ubuntu SMP Mon Sep 22 21:28:38 UTC 2014 x86_64
        x86_64 x86_64 GNU/Linux"}'
  response:
    status:
      code: 200
      message: 'OK '
    headers:
      X-Frame-Options:
      - SAMEORIGIN
      X-Xss-Protection:
      - 1; mode=block
      X-Content-Type-Options:
      - nosniff
      Content-Type:
      - application/json; charset=utf-8
      Etag:
      - '"84895ca1ba655182fc1dc8207f557011"'
      Cache-Control:
      - max-age=0, private, must-revalidate
      X-Request-Id:
      - afc4492e-e3ce-48b4-afb3-2bd16042e4d4
      X-Runtime:
      - '0.022162'
      Server:
      - WEBrick/1.3.1 (Ruby/2.0.0/2014-05-08)
      Date:
      - Sun, 26 Oct 2014 13:01:09 GMT
      Content-Length:
      - '225'
      Connection:
      - Keep-Alive
      Set-Cookie:
      - request_method=GET; path=/
    body:
      encoding: UTF-8
      string: '[{"object":"subscription","start":"2014-10-24T21:55:06.000Z","canceled_at":null,"id":"sub_3f8fab0de092d9","metadata":{"provider":"heroku"},"plan":{"object":"plan","slug":"test","amount":0,"currency":"usd"},"customer":"1398"}]'
    http_version: 
  recorded_at: Sun, 26 Oct 2014 13:01:09 GMT
recorded_with: VCR 2.9.3
